{
  "backend/main.mo": "Motoko actor storing unique inquiries in a Set, allowing submission and retrieval while preventing duplicates.",
  "feature_evidence.json": "Feature evidence report listing feature changes, affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Text file mapping frontend file paths to short descriptive summaries of their purpose and behavior.",
  "frontend/index.css": "Tailwind base layer with extensive OKLCH color variables, dark mode tokens, and global background/text styles.",
  "frontend/index.html": "HTML entry point defining metadata, title, description, and mounting root for the React app.",
  "frontend/src/App.tsx": "Main React component assembling all marketing sections with header and footer into a single-page layout.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer component with branding, navigation links, service list, contact links, and dynamic year display.",
  "frontend/src/components/layout/SiteHeader.tsx": "Sticky header providing logo, navigation, email/WhatsApp CTAs, and a mobile drawer menu.",
  "frontend/src/components/marketing/ContactSection.tsx": "Contact section with inquiry form, validation, status handling, and submission via a React Query mutation.",
  "frontend/src/components/marketing/FaqSection.tsx": "Renders a FAQ section with an accordion listing preset questions and answers.",
  "frontend/src/components/marketing/HeroSection.tsx": "Displays the hero banner with headline, call‑to‑action buttons, and an illustration.",
  "frontend/src/components/marketing/ProcessSection.tsx": "Shows a five‑step visual process flow with icons and descriptions.",
  "frontend/src/components/marketing/ServicesSection.tsx": "Lists service offerings as cards with icons, descriptions, and CTA buttons.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refetching queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity loading, and status management.",
  "frontend/src/hooks/useSubmitInquiryMutation.ts": "Defines a mutation that submits an inquiry through the backend actor and invalidates related queries.",
  "frontend/src/index.css": "Tailwind base styles plus custom warm‑tone theme variables and utility classes.",
  "frontend/src/lib/inquiryLinks.ts": "Generates WhatsApp and email inquiry links with prefilled messages.",
  "frontend/src/main.tsx": "App entry point initializing React, query client, and Internet Identity provider.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom fonts, color tokens, animations, and plugin support.",
  "project_state.json": "Project metadata describing requirements, existing features, and the goal of building a modern business-focused marketing website."
}