{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Update WhatsApp numbers and contact email links",
  "requirements": [
    {
      "id": "REQ-19",
      "summary": "Update inquiry link generators to use the provided email address and digits-only WhatsApp wa.me links while preserving the existing pre-filled inquiry message.",
      "acceptanceCriteria": [
        "The generated email link uses: priyankadbrao@gmail.com",
        "The generated WhatsApp links use digits-only phone numbers in wa.me format: 918095126443 and 919663848939",
        "All WhatsApp links include the existing pre-filled inquiry message text"
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/inquiryLinks.ts",
          "operation": "modify",
          "description": "Replace placeholder contact values with the provided email (priyankadbrao@gmail.com) and WhatsApp numbers; ensure wa.me numbers are digits-only (strip '+', spaces, and non-digits) and keep the existing pre-filled WhatsApp inquiry message text unchanged; expose helper(s) suitable for generating links for both WhatsApp numbers."
        }
      ]
    },
    {
      "id": "REQ-20",
      "summary": "Update site WhatsApp CTAs to let visitors choose between the two WhatsApp numbers in Header, Footer, and Contact section (and remove any remaining placeholder WhatsApp links).",
      "acceptanceCriteria": [
        "Site Header WhatsApp CTA provides access to both WhatsApp numbers (918095126443 and 919663848939) without removing the existing Email CTA",
        "Site Footer WhatsApp link provides access to both WhatsApp numbers (918095126443 and 919663848939)",
        "Contact section WhatsApp card provides access to both WhatsApp numbers (918095126443 and 919663848939)",
        "No WhatsApp CTA on the site links to placeholder number(s) (e.g., '1234567890')"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/SiteHeader.tsx",
          "operation": "modify",
          "description": "Update the desktop and mobile header WhatsApp CTA UI to provide two explicit WhatsApp choices (918095126443 and 919663848939) using the updated inquiry link generator(s), while keeping the existing Email CTA intact."
        },
        {
          "path": "frontend/src/components/layout/SiteFooter.tsx",
          "operation": "modify",
          "description": "Update the footer WhatsApp link area to provide two WhatsApp choices (918095126443 and 919663848939) using the updated inquiry link generator(s), ensuring no placeholder WhatsApp number remains."
        },
        {
          "path": "frontend/src/components/marketing/ContactSection.tsx",
          "operation": "modify",
          "description": "Update the Contact section WhatsApp card to provide two WhatsApp choices (918095126443 and 919663848939) using the updated inquiry link generator(s), ensuring the Email card remains mailto-only (no email-sending logic added)."
        },
        {
          "path": "frontend/src/components/marketing/HeroSection.tsx",
          "operation": "modify",
          "description": "Ensure the hero WhatsApp CTA no longer uses any placeholder number by wiring it to one of the real WhatsApp links or presenting the same two-number choice pattern used elsewhere, using the updated inquiry link generator(s)."
        }
      ]
    }
  ]
}